### Terraform Plan Result - Plan Failed

### OK Estimated Monthly Cost: $0.00

<details>
<summary>Plan details (click to expand)</summary>

```
## Category: s3
  Files: 7

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.32.1...
- Installed hashicorp/aws v6.32.1 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
=== Auto-import existing resources ===
  IMPORT aws_cloudtrail.remediation_cloudtrail ← security-cloudtail
Acquiring state lock. This may take a few moments...
[0m[1mdata.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.remediation_s3_bucket_encryption_policy: Reading...[0m[0m
[0m[1mdata.aws_s3_bucket.remediation_aws_cloudtrail_logs: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.remediation_cloudtrail_logs_kms_key_policy: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.remediation_s3_bucket_policy: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.remediation_s3_bucket_policy: Read complete after 0s [id=4094443466][0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mdata.aws_iam_policy_document.remediation_cloudtrail_logs_kms_key_policy: Read complete after 0s [id=527012578][0m
[0m[1maws_cloudtrail.remediation_cloudtrail: Importing from ID "security-cloudtail"...[0m
[0m[1mdata.aws_iam_policy_document.remediation_s3_bucket_encryption_policy: Read complete after 0s [id=762409746][0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=ap-northeast-2][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=132410971304][0m
[0m[1mdata.aws_s3_bucket.remediation_aws_cloudtrail_logs: Read complete after 1s [id=aws-cloudtrail-logs-132410971304-0971c04b][0m
[33m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "s3_enable_bucket_acl"
[33m│[0m [0mbut a value was found in file "s3.auto.tfvars". If you meant to use this
[33m│[0m [0mvalue, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[0m[0m
[33m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named
[33m│[0m [0m"s3_create_logging_kms_key" but a value was found in file "s3.auto.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[0m[0m
[33m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValues for undeclared variables[0m
[33m│[0m [0m
[33m│[0m [0m[0mIn addition to the other similar warnings shown, 9 other variable(s)
[33m│[0m [0mdefined without being declared.
[33m╵[0m[0m
[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mcould not parse import ID "security-cloudtail" as ARN: arn: invalid prefix[0m
[31m│[0m [0m
[31m│[0m [0m[0m
[31m╵[0m[0m
[0m[0m
::error::Terraform exited with code 1.
  WARN: import failed for aws_cloudtrail.remediation_cloudtrail (non-fatal)
Auto-import done: imported=0 skipped=0
WARN s3: tfsec found issues (non-blocking)
[32m[1mSuccess![0m The configuration is valid.
[0m
Acquiring state lock. This may take a few moments...
aws_s3_bucket_versioning.remediation_s3_bucket_versioning: Refreshing state... [id=aws-cloudtrail-logs-132410971304-0971c04b]
data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
aws_kms_key.remediation_s3_bucket_key: Refreshing state... [id=f17d8c4a-29b6-46a2-9ddf-47028e2506ac]
data.aws_iam_policy_document.remediation_s3_bucket_encryption_policy: Reading...
aws_s3_bucket_server_side_encryption_configuration.remediation_s3_bucket_encryption: Refreshing state... [id=aws-cloudtrail-logs-132410971304-0971c04b]
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.remediation_s3_bucket_encryption_policy: Read complete after 0s [id=762409746]
data.aws_s3_bucket.remediation_aws_cloudtrail_logs: Reading...
data.aws_iam_policy_document.remediation_s3_bucket_policy: Reading...
data.aws_iam_policy_document.remediation_cloudtrail_logs_kms_key_policy: Reading...
aws_s3_bucket_policy.remediation_s3_bucket_policy: Refreshing state... [id=aws-cloudtrail-logs-132410971304-0971c04b]
data.aws_iam_policy_document.remediation_s3_bucket_policy: Read complete after 0s [id=4094443466]
data.aws_iam_policy_document.remediation_cloudtrail_logs_kms_key_policy: Read complete after 0s [id=527012578]
data.aws_region.current: Reading...
aws_s3_bucket_policy.remediation_s3_bucket_encryption_policy: Refreshing state... [id=aws-cloudtrail-logs-132410971304-0971c04b]
data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_caller_identity.current: Read complete after 0s [id=132410971304]
data.aws_s3_bucket.remediation_aws_cloudtrail_logs: Read complete after 1s [id=aws-cloudtrail-logs-132410971304-0971c04b]
aws_s3_bucket_policy.remediation_aws_cloudtrail_logs_policy: Refreshing state... [id=aws-cloudtrail-logs-132410971304-0971c04b]
aws_s3_bucket_server_side_encryption_configuration.remediation_aws_cloudtrail_logs_encryption: Refreshing state... [id=aws-cloudtrail-logs-132410971304-0971c04b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_kms_key.remediation_cloudtrail_logs_kms_key will be created
  + resource "aws_kms_key" "remediation_cloudtrail_logs_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for CloudTrail logs encryption"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_kms_key.remediation_s3_bucket_encryption_key will be created
  + resource "aws_kms_key" "remediation_s3_bucket_encryption_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key for S3 bucket encryption"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_kms_key_policy.remediation_cloudtrail_logs_kms_key_policy will be created
  + resource "aws_kms_key_policy" "remediation_cloudtrail_logs_kms_key_policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:GenerateDataKey*"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-northeast-2"
    }

  # aws_s3_bucket.remediation_cloudtrail_logs will be created
  + resource "aws_s3_bucket" "remediation_cloudtrail_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "aws-cloudtrail-logs-132410971304-0971c04b"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "s3-access-logs/"
        }
    }

  # aws_s3_bucket.remediation_cloudtrail_logs_destination will be created
  + resource "aws_s3_bucket" "remediation_cloudtrail_logs_destination" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "remediation-cloudtrail-logs-132410971304"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.remediation_s3_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "remediation_s3_bucket_lifecycle" {
      + bucket                                 = "aws-cloudtrail-logs-132410971304-0971c04b"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-northeast-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "lifecycle-rule-1"
          + status = "Enabled"

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }
        }
    }

  # aws_s3_bucket_ownership_controls.remediation_s3_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "remediation_s3_bucket_ownership_controls" {
      + bucket = "aws-cloudtrail-logs-132410971304-0971c04b"
      + id     = (known after apply)
      + region = "ap-northeast-2"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_policy.remediation_aws_cloudtrail_logs_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "remediation_aws_cloudtrail_logs_policy" {
        id     = "aws-cloudtrail-logs-132410971304-0971c04b"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "s3:PutObject" -> [
                          + "s3:GetBucketAcl",
                          + "s3:GetBucketPolicy",
                          + "s3:ListBucket",
                          + "s3:PutBucketAcl",
                          + "s3:PutBucketPolicy",
                        ]
                      - Condition = {
                          - StringNotEquals = {
                              - "s3:x-amz-server-side-encryption" = "aws:kms"
                            }
                        }
                      ~ Effect    = "Deny" -> "Allow"
                      ~ Principal = "*" -> {
                          + AWS = "*"
                        }
                      ~ Resource  = "arn:aws:s3:::aws-cloudtrail-logs-132410971304-0971c04b/*" -> [
                          + "arn:aws:s3:::aws-cloudtrail-logs-132410971304-0971c04b",
                          + "arn:aws:s3:::aws-cloudtrail-logs-132410971304-0971c04b/*",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.remediation_s3_bucket_encryption_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "remediation_s3_bucket_encryption_policy" {
        id     = "aws-cloudtrail-logs-132410971304-0971c04b"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringNotEquals = {
                              ~ "s3:x-amz-server-side-encryption" = "aws:kms" -> "AES256"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.remediation_s3_bucket_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "remediation_s3_bucket_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "aws-cloudtrail-logs-132410971304-0971c04b"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-2"
      + restrict_public_buckets = true
    }

Plan: 8 to add, 2 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "s3_enable_mfa_delete" but
a value was found in file "s3.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "s3_create_kms_key" but a
value was found in file "s3.auto.tfvars". If you meant to use this value, add
a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 9 other variable(s) defined
without being declared.
::error::Terraform exited with code 1.

```

</details>

> Merging this PR will auto-apply these resources to AWS.